Tekla Open API Reference for Tekla Structures 2025
CylindricalSurface Constructor (Arc, Double)
 Initializes a new instance of the CylindricalSurface class from a base arc and a height. This is the recommended constructor if no intermediate points are desired along the lateral boundaries of the bend surface.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public CylindricalSurface(
	Arc baseArc,
	double height
)
Public Sub New (
	baseArc As Arc,
	height As Double
)
Parameters
baseArc
Type: Tekla.Structures.Geometry3d.Arc
Arc to form the base of the bend surface
height
Type: System.Double
Height of the surface measured along the normal of the arc, may be positive or negative, but always nonzero
Exceptions
Exception | Condition
ArgumentException | Thrown if the given lengths are invalid
See Also
Reference
CylindricalSurface Class
CylindricalSurface Overload
Tekla.Structures.Model Namespace